Revit 2024 API
Transform1D Constructor (Double, Double)
 Constructs the transformation by specifying the scale and the translation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public Transform1D(
	double scale,
	double translation
)
Visual Basic
Public Sub New ( _
	scale As Double, _
	translation As Double _
)
Visual C++
public:
Transform1D(
	double scale,
	double translation
)
Parameters
scale
Type: System.Double
 The scale of the transformation.
translation
Type: System.Double
 The translational part of the transformation.
Remarks
 1D space is tranformed according to the following formula: t --> scale*t + translation
See Also
Transform1D Class
Transform1D Overload
Autodesk.Revit.DB Namespace